/**
 * Created by gaord on 2017/2/20.
 */
package tl.frameworks.defines
{
	/** 精灵类型 */
	public class WizardType
	{
		public static const LABEL:Vector.<String> = Vector.<String>(
				[
					"英雄", "Npc", "场景特效", "搜捡怪物", "怪物", "Boss怪物", "受击破碎特效", "受击溅血特效", "翅膀", "坐骑"
					, "武器", "搜检部件（点击打开）", "场景小精灵", "镖车", "地表模型", "建筑模型", "野外BOSS", "阻挡特效", "功能性特效", "界面展示模型",
					"怪物（有尸体）", "特效模型（同场景特效）", "特效怪物（只显示血条）", "固定不动怪", "友方Boss怪物", "竞技场用怪", "特效怪（没有鼠标事件）",
					"宠物", "搜捡部件（需要攻击）", "采集类型", "篝火专用", "可以被占领的生物", "要塞支持类建筑", "要塞防御类建筑", "要塞陷阱", "掉落物品"
				]);

	}
}
